angular.factory('SearchService', function ($rootScope) {

    var cities = [
        'София',
        'Варна',
        'Пловдив',
        'Бургас',
        'Слънчев бряг',
        'Русе',
        'Стара Загора',
        'Велико Търново',
        'Плевен',
        'Шумен',
        'Друг'
    ];

    // Categories
    var categories = [
        {id: 1, name: 'ИТ - Разработка/поддръжка на софтуер хардуер'},
        {id: 2, name: 'Счетоводство, Одит'},
        {id: 3, name: 'Административни дейности'},
        {id: 4, name: 'Банково дело и Финанси'},
        {id: 5, name: 'Инженерни дейности'},
        {id: 6, name: 'Здравеопазване (Медицински работници)'},
        {id: 7, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 8, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 9, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 10, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 11, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 12, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 13, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 14, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 15, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 16, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 17, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 18, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 19, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 20, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 21, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 22, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 23, name: 'Архитектура, Строителство и Градоустройство'},
        {id: 24, name: 'Архитектура, Строителство и Градоустройство'},
    ];


    // search adverts
    return {
        getSearchData: function() {
            return {            
                categories,
                cities
            };
            //return $rootScope.promise.get('/api/profile')        
        }
    }
}
);

